#### ExternalDataInstanceRemovedFromDocumentEventArgs Members

---

|  |
| --- |
| ExternalDataInstanceRemovedFromDocumentEventArgs Class   Methods   Properties   See Also |

The  ExternalDataInstanceRemovedFromDocumentEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RevitAPIEventArgs  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsCancelled | Indicates whether the event is being cancelled. (Inherited from  RevitAPIEventArgs  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from  RevitAPIEventArgs  .) |
| Public property | Document | The document associated with the event. (Inherited from  RevitAPIPostDocEventArgs  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RevitAPIEventArgs  .) |
| Public property | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from  RevitAPIPostEventArgs  .) |
| Public property | TypeId | The type id of the external data instance id that has been removed from Revit document. |

# See Also

ExternalDataInstanceRemovedFromDocumentEventArgs Class

Autodesk.Revit.DB.Events Namespace